# CouplerTypeInvalid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..CouplerTypeInvalid Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This coupler type does not fit on the selected bar(s). Post error to delete the coupler.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouplerTypeInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerTypeInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouplerTypeInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace